var app = angular.module('myApp');

app.constant('typesOfTrainingConstant', [

    {
        type: "Бадминтон",
        value: 5.3,
        num:1
    },
    {
        type: "Бег со скоростью 200 м/мин",
        value: 10.05,
        num:2
    },
    {
        type: "Бег со скоростью 325 м/мин",
        value: 37.5,
        num:3
    },
    {
        type: "Бег со скоростью 8 км/час",
        value: 8.13,
        num:4
    },
    {
        type: "Гимнастика",
        value: 5.01,
        num:5
    },
    {
        type: "Езда на велосипеде со скоростью 3,5 км/ч",
        value: 2.54,
        num:6
    },
    {
        type: "Езда на велосипеде со скоростью 10 км/ч",
        value: 4.26,
        num:7
    },
    {
        type: "Езда на велосипеде со скоростью 15 км/ч",
        value: 6.05,
        num:8
    },
    {
        type: "Езда на велосипеде со скоростью 20 км/ч",
        value: 8.56,
        num:9
    },
    {
        type: "Занятие аэробикой",
        value: 7.2,
        num:10
    },
    {
        type: "Йога",
        value: 4,
        num:11
    },
    {
        type: "Катание на коньках",
        value: 6.4,
        num:12
    },
    {
        type: "Плавание со скоростью 10 м/мин",
        value: 3.0,
        num:13
    },
    {
        type: "Плавание со скоростью 50 м/мин",
        value: 10.2,
        num:14
    },
    {
        type: "Подъем по лестнице/степ",
        value: 10.2,
        num:15
    },
    {
        type: "Прыжки со скакалкой",
        value: 7.2,
        num:16
    },
    {
        type: "Растяжка",
        value: 3.7,
        num:17
    },
    {
        type: "Танец быстрый",
        value: 6.16,
        num:18
    },
    {
        type: "Танец медленный",
        value: 4.06,
        num:19
    },
    {
        type: "Теннис большой",
        value: 7,
        num:20
    },
    {
        type: "Теннис настольный",
        value: 5.03,
        num:21
    },
    {
        type: "Ходьба в гору с небольшим подъемом",
        value: 6.52,
        num:22
    },
    {
        type: "Ходьба по ровной дороге со скоростью 4,2 км/ч",
        value: 3.14,
        num:23
    },
    {
        type: "Ходьба по ровной дороге со скоростью 6 км/ч",
        value: 4.85,
        num:24
    }

]);